BaseConfiguration/Money_2_0/Documents/РегламентированныйОтчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>РегламентированныйОтчет</Name>
			<Comment>Регламентированный отчет</Comment>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчетности</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбраннаяФорма</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеОтчета</Name>
					<Comment>(Общ) Сохраненные данные отчета</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписи</Name>
					<Comment>(Общ) Дата подписи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДеревоНастройкиСтраниц</Name>
					<Comment>(Общ) Дерево со списком настроек страниц</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругленияОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПомощникЗаполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникОтчета</Name>
					<Comment>(Общ) Имя встроенной или имя файла внешней обработки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодНалоговогоОргана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодНалоговогоОрганаПосредника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОтчета</Name>
					<Comment>(Общ) Наименование регламентированного отчета</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПачки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Comment>(Общ) Периодичность представления отчета</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеВида</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочностьЕдиницыИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СправочникБанкиБРО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДекларацияСдана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяСумма</Name>
					<Comment>Контрольная сумма объекта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>65</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоментИзменения</Name>
					<Comment>Универсальное время последнего изменения объекта в миллисекундах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

BaseConfiguration/Money_2_0/Documents/ВыгрузкаРегламентированныхОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВыгрузкаРегламентированныхОтчетов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.АрхивДанныхРегламентированнойОтчетности</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодНалоговогоОргана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборПоНалоговомуОргану</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Основная</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РегламентированныйОтчет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиТекстаВыгрузки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Выгрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВерсииФорматовВыгрузки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

BaseConfiguration/Money_2_0/Catalogs/РегламентированныеОтчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>РегламентированныеОтчеты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИсточникОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периоды</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийОтчетИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийОтчетХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийОтчетВерсия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УИДОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

BaseConfiguration/Money_2_0/Documents/РегламентированныйОтчет/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Перем ВидОтчетаДляАктивизацииВIE;


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере()
	
	мНазвФормыФильтра = "";

	// ДЕНЬГИ
	Если Параметры.Свойство("Организация") И ЗначениеЗаполнено(Параметры.Организация) Тогда
		Организация = Параметры.Организация;
	Иначе
		ПроверитьОсновнуюОрганизацию();
	КонецЕсли;
	// Конец ДЕНЬГИ
	
	Если мРежимРаботы = Неопределено Тогда
		мРежимРаботы = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		УстановитьОтборПоОрганизации();
	КонецЕсли;
				
	// ДЕНЬГИ
	УстановитьВидимостьПоляОрганизации();
	ПроверитьРеквизитыОрганизации();
 	// Конец ДЕНЬГИ
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	// ДЕНЬГИ СохранитьНастройки();
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Записан 3-НДФЛ" Или ИмяСобытия = "Запись_РегламентированныйОтчет" Тогда
		Элементы.Список.Обновить();
	ИначеЕсли ИмяСобытия = "Запись_Организация" Тогда 
		ПроверитьРеквизитыОрганизации();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если ЗначениеЗаполнено(Настройки) И ЗначениеЗаполнено(Настройки["Организация"]) Тогда
		Организация = Настройки["Организация"];
		УстановитьОтборПоОрганизации();
		ПроверитьРеквизитыОрганизации();
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ПроверитьОсновнуюОрганизацию();
	КонецЕсли;
	
	УстановитьОтборПоОрганизации();
	ПроверитьРеквизитыОрганизации();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеОрганизацииНажатие(Элемент, СтандартнаяОбработка)
	ОткрытьФормуОрганизации();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормы_Список

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	Если НЕ Копирование Тогда
		
		ДобавлениеОтчетаВЖурналеОтчетов();
		
	Иначе
		
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
				
		Если ТекущиеДанные <> Неопределено Тогда
			
			Ссылка = ТекущиеДанные.Ссылка;
			ПараметрыФормы = Новый Структура("ЗначениеКопирования", Ссылка); 
			
			// ДЕНЬГИ
			//Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.ЭлектронныеПредставленияРегламентированныхОтчетов") Тогда
			//	
			//	ОткрытьФорму("Справочник.ЭлектронныеПредставленияРегламентированныхОтчетов.ФормаОбъекта", ПараметрыФормы);
			//	
			//ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.РегламентированныйОтчет") Тогда
			Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.РегламентированныйОтчет") Тогда
		 	// Конец ДЕНЬГИ
				
				ОткрытьФорму("Документ.РегламентированныйОтчет.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
				
			Иначе
				
				ИмяФормыОбъекта = ИмяФормыОбъектаПоУмолчанию(Ссылка);
				ОткрытьФорму(ИмяФормыОбъекта, ПараметрыФормы);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры



#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьЖурналВыгрузки(Команда)
			
	ОткрытьФорму("Документ.ВыгрузкаРегламентированныхОтчетов.Форма.ФормаСписка", , ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизиты(Команда)
	ОткрытьФормуОрганизации();
КонецПроцедуры

// ДЕНЬГИ 
&НаКлиенте
Процедура ДекларацияСдана(Команда)
	ИзменитьСостояниеДекларации(Новый ФиксированныйМассив(Элементы.Список.ВыделенныеСтроки), Истина);
КонецПроцедуры

// ДЕНЬГИ 
&НаКлиенте
Процедура ОтменитьСдачуДекларации(Команда)
	ИзменитьСостояниеДекларации(Новый ФиксированныйМассив(Элементы.Список.ВыделенныеСтроки), Ложь);
КонецПроцедуры



#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборПоОрганизации()
	
	Перем ОтборОрганизация;
	
	ОтборДинамическогоСписка = Список.КомпоновщикНастроек.Настройки.Отбор;
		
	Для Каждого Элемент Из ОтборДинамическогоСписка.Элементы Цикл
		
		Если Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация") Тогда
			ОтборОрганизация = Элемент;
		КонецЕсли;
				
	КонецЦикла;
	
	Если ОтборОрганизация = Неопределено Тогда
		ОтборОрганизация = ОтборДинамическогоСписка.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборОрганизация.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация");
	КонецЕсли;
				
	ОтборОрганизация.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборОрганизация.ПравоеЗначение = Организация;
		
	ОтборОрганизация.Использование = ЗначениеЗаполнено(Организация); // ДЕНЬГИ Истина;
	// ДЕНЬГИ
	Элементы.СписокОрганизация.Видимость = Не ОтборОрганизация.Использование;
	// Конец ДЕНЬГИ 
	
	ОтборДинамическогоСписка.ИдентификаторПользовательскойНастройки = Строка(Новый УникальныйИдентификатор);
	
	// ДЕНЬГИ СохранитьНастройки();
			
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИмяФормыОбъектаПоУмолчанию(Ссылка)
	
	Возврат Ссылка.Метаданные().ПолноеИмя() + ".ФормаОбъекта";
	
КонецФункции

&НаКлиенте
Процедура ДобавлениеОтчетаВЖурналеОтчетов()
	
	// ДЕНЬГИ
	СписокОтчетов = Новый СписокЗначений;
	СписокОтчетов.Добавить("3-НДФЛ", "Декларация 3-НДФЛ");
	СписокОтчетов.Добавить("4-НДФЛ", "Декларация 4-НДФЛ");
	Оповещение = Новый ОписаниеОповещения("ВыборВидаОтчетаЗавершение", ЭтотОбъект);
	СписокОтчетов.ПоказатьВыборЭлемента(Оповещение, НСтр("ru = 'Укажите вид декларации'"));
	Возврат;
	// Конец ДЕНЬГИ
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеОтчетаВЖурналеОтчетовЗавершение(ВыбранныйВидОтчета, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(ВыбранныйВидОтчета) Тогда
		ОткрытьФормуОтчетаНаКлиенте(ВыбранныйВидОтчета);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОтчетаНаКлиенте(Отчет)
	
	ОрганизацияОтчета          = Неопределено;
	ДатаНачалаПериодаОтчета    = Неопределено;
	ДатаОкончанияПериодаОтчета = Неопределено;
	ПериодичностьОтчета        = Неопределено;
	
	НаименованиеОтчета = "";
	
	РезультатОткрытияФормыНаСервере = ОткрытьФормуОтчетаНаСервере(Отчет, ОрганизацияОтчета, ДатаНачалаПериодаОтчета, 
																ДатаОкончанияПериодаОтчета, ПериодичностьОтчета, НаименованиеОтчета);
			
	ФормаОткрытаУспешно = Истина;
		
	Если РезультатОткрытияФормыНаСервере = "Недостаточно прав" Тогда

		ПоказатьПредупреждение(,НСтр("ru='Недостаточно прав.'"));
		ФормаОткрытаУспешно = Ложь;
				
	ИначеЕсли РезультатОткрытияФормыНаСервере = "Отчет не найден" Тогда
				
		ПоказатьПредупреждение(,НСтр("ru='Отчет не найден.'"));
		ФормаОткрытаУспешно = Ложь;
				
	ИначеЕсли РезультатОткрытияФормыНаСервере = "Не удалось открыть отчет" Тогда
				
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Не удалось открыть отчет.'");
		Сообщение.Сообщить();
		
		ФормаОткрытаУспешно = Ложь;
		
	ИначеЕсли РезультатОткрытияФормыНаСервере = "Открыть внутренний отчет-документ" Тогда
		
		Если Отчет.ИсточникОтчета = "РегламентированныйОтчетРСВ1" Тогда
			
			ИмяФормыОтчета = "Документ." + Отчет.ИсточникОтчета + ".Форма." + РегламентированнаяОтчетностьКлиентСерверПереопределяемый.ИмяОсновнойФормыРСВ1();
						
		Иначе
			
			ИмяФормыОтчета = "Документ." + Отчет.ИсточникОтчета + ".Форма.ОсновнаяФорма";
						
		КонецЕсли;
			
	ИначеЕсли ТипЗнч(РезультатОткрытияФормыНаСервере) = Тип("Структура") Тогда
		
		Если Отчет.ИсточникОтчета = "РегламентированныйОтчетРСВ1" Тогда
			
			ИмяФормыОтчета = "Отчет." + Отчет.ИсточникОтчета + ".Форма." + РегламентированнаяОтчетностьКлиентСерверПереопределяемый.ИмяОсновнойФормыРСВ1();
			
		Иначе
			
			ИмяФормыОтчета = "Отчет." + Отчет.ИсточникОтчета + ".Форма.ОсновнаяФорма";
			
		КонецЕсли;
	КонецЕсли;
	
	Если ФормаОткрытаУспешно Тогда
		
		// Сначала попробуем найти его среди открытых стартовых форм.
		// Необходимо для предотвращения
		// открытия нескольких стартовых форм одного отчета.
		НайденоОкно = Ложь;
		РегламентированнаяОтчетностьКлиент.ВебКлиентНайтиАктивизироватьОкно(ИмяФормыОтчета,ЭтаФорма,НайденоОкно);
		Если НайденоОкно <> Неопределено Тогда
			Если НайденоОкно Тогда
				
				Возврат;
				
			КонецЕсли;
		КонецЕсли;
	
		Если ТипЗнч(РезультатОткрытияФормыНаСервере) = Тип("Структура") Тогда
			
			ОткрытьФорму(ИмяФормыОтчета, РезультатОткрытияФормыНаСервере, ЭтаФорма, ИмяФормыОтчета, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			РезультатОткрытияФормыНаСервере.Удалить("ВнешнийОтчетИспользовать");
			
		Иначе
			
			ОткрытьФорму(ИмяФормыОтчета, , ЭтаФорма, ИмяФормыОтчета, , , ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОткрытьФормуОтчетаНаСервере(Знач Отчет, ОрганизацияОтчета, ДатаНачалаПериодаОтчета, 
				                    ДатаОкончанияПериодаОтчета, ПериодичностьОтчета, НаименованиеОтчета)
	
	ИсточникОтчета = Отчет.ИсточникОтчета;
	
	НаименованиеИзСправочника = Отчет.Наименование;
	МетаОтчет = Метаданные.Отчеты.Найти(ИсточникОтчета);
	Если МетаОтчет <> Неопределено И МетаОтчет.ОсновнаяФорма <> Неопределено Тогда
		
		НаименованиеОтчета = МетаОтчет.ОсновнаяФорма.Синоним;
		
	Иначе
		
		НаименованиеОтчета = НаименованиеИзСправочника;
		
	КонецЕсли;

	
	ПравоДоступаКОтчету = РегламентированнаяОтчетностьВызовСервера.ПравоДоступаКРегламентированномуОтчету(ИсточникОтчета);
	
	Если ПравоДоступаКОтчету = Ложь Тогда
		Возврат "Недостаточно прав";
	ИначеЕсли ПравоДоступаКОтчету = Неопределено Тогда
		Возврат "Отчет не найден";
	КонецЕсли;
		
	Если Метаданные.Документы.Найти(ИсточникОтчета) <> Неопределено Тогда // это внутренний отчет-документ
		Возврат "Открыть внутренний отчет-документ";
	КонецЕсли;
	
	ТекОтчет = РегламентированнаяОтчетность.РеглОтчеты(ИсточникОтчета);
	Если ТекОтчет = Неопределено Тогда
		Возврат "Не удалось открыть отчет";
	КонецЕсли;
	
	ТекФорма = РегламентированнаяОтчетность.ФормаРеглОтчета(ИсточникОтчета);
	Если ТекФорма = Неопределено Тогда
		Возврат "Не удалось открыть отчет";
	КонецЕсли;
	
	ПараметрыТекФормы = Новый Структура;
	ПараметрыТекФормы.Вставить("Организация");
	ПараметрыТекФормы.Вставить("мДатаНачалаПериодаОтчета");
	ПараметрыТекФормы.Вставить("мДатаКонцаПериодаОтчета");
	ПараметрыТекФормы.Вставить("мПериодичность");
	
	Если ЗначениеЗаполнено(Организация) Тогда
		Попытка
			ПараметрыТекФормы.Организация = Организация;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	ПараметрыТекФормы.Вставить("ИсточникОтчета", ИсточникОтчета);
		
	Возврат ПараметрыТекФормы;
	
КонецФункции

&НаКлиенте
Процедура ПодождатьДляIE()
	
	ОтключитьОбработчикОжидания("ПодождатьДляIE");
	Оповестить(ВидОтчетаДляАктивизацииВIE, "Активизировать");

КонецПроцедуры


&НаКлиенте
Процедура ВыборВидаОтчетаЗавершение(Выбор, ДополнительныеПараметры) Экспорт

	Если Выбор = Неопределено Тогда
		Возврат;
	ИначеЕсли Выбор.Значение = "3-НДФЛ" Тогда
		ОткрытьФорму("Отчет.РегламентированныйОтчет3НДФЛ.Форма.ОсновнаяФорма", Новый Структура("Организация"));
	ИначеЕсли Выбор.Значение = "4-НДФЛ" Тогда
		ОткрытьФорму("Отчет.РегламентированныйОтчет4НДФЛ.Форма.ОсновнаяФорма", Новый Структура("Организация"));
	КонецЕсли; 
	Возврат;

КонецПроцедуры

&НаСервереБезКонтекста
Функция СсылкаСправочникаРегОтчетов(НаименованиеОтчета)
	
	Возврат Справочники.РегламентированныеОтчеты.НайтиПоНаименованию(НаименованиеОтчета);
	
КонецФункции 

&НаКлиенте
Процедура Создать3НДФЛ(Команда)
	
	НаименованиеОтчета = "Декларация 3-НДФЛ";
	СсылкаВидОтчета = СсылкаСправочникаРегОтчетов(НаименованиеОтчета);
	СтруктураОтчета = Новый Структура("ИсточникОтчета,Наименование,Ссылка", 
			"РегламентированныйОтчет3НДФЛ", НаименованиеОтчета, СсылкаВидОтчета);
	ОткрытьФормуОтчетаНаКлиенте(СтруктураОтчета);
	//ОткрытьФорму("Отчет.РегламентированныйОтчет3НДФЛ.Форма.ОсновнаяФорма", Новый Структура("Организация"));
	
КонецПроцедуры

&НаКлиенте
Процедура Создать4НДФЛ(Команда)
	
	ОткрытьФорму("Отчет.РегламентированныйОтчет4НДФЛ.Форма.ОсновнаяФорма", Новый Структура("Организация"));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПоляОрганизации()
	
	НесколькоОрганизаций = Справочники.Организации.КоличествоОрганизаций();
	Если НесколькоОрганизаций Тогда
		Элементы.Организация.Видимость = Истина;
		Элементы.ОрганизацияЕдинственная.Видимость = Ложь;
	Иначе
		Элементы.Организация.Видимость = Ложь;
		Элементы.ОрганизацияЕдинственная.Видимость = Истина;
		ПредставлениеОрганизации = ?(ЗначениеЗаполнено(Организация), 
				Организация.НаименованиеСокращенное, НСтр("ru='не выбран'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьРеквизитыОрганизации()
	
	Если РеквизитыЗаполненыКорректно(Организация) Тогда
		Элементы.СтраницыСпискаИПроверки.ТекущаяСтраница = Элементы.СтраницаСписок;
		Элементы.ДобавитьОрганизацию.Доступность = Истина;
	Иначе
		Элементы.ДобавитьОрганизацию.Доступность = Ложь;
		Элементы.СтраницыСпискаИПроверки.ТекущаяСтраница = Элементы.СтраницаНетРеквизитов;
		ТекстОшибокРеквизитов = НСтр("ru='Пожалуйста, заполните реквизиты налогоплательщика для продолжения работы с налоговыми декларациями'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьОсновнуюОрганизацию()
	
	Если Справочники.Организации.КоличествоОрганизаций() = 0 Тогда
		ОрганизацияОбъект = Справочники.Организации.СоздатьЭлемент();
		ОрганизацияОбъект.Заполнить(Истина);
		ОрганизацияОбъект.Наименование = "Новый налогоплательщик";
		ОрганизацияОбъект.НаименованиеСокращенное = "налогоплательщик без реквизитов!";
		ОрганизацияОбъект.Записать();
		Организация = ОрганизацияОбъект.Ссылка;
	Иначе
		Организация = Деньги3НДФЛ.ОрганизацияПоУмолчанию(); 
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РеквизитыЗаполненыКорректно(Организация)
	
	НезаполненныеРеквизиты = Неопределено;
	РеквизитыОрганизацииЗаполнены = ЗначениеЗаполнено(Организация) 
		И ОрганизацииФормыДляОтчетности.РеквизитыЗаполнены(
				Организация, 
				ПроверяемыеРеквизитыОрганизации(), 
				НезаполненныеРеквизиты);
	
	Возврат РеквизитыОрганизацииЗаполнены;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПроверяемыеРеквизитыОрганизации()
	
	СтрокаРеквизиты = "ИНН,ФамилияИП,ИмяИП,КодПоОКТМО,КодНалоговогоОргана,ТелефонОрганизации,
		|Гражд,КодУдЛичн,ОрганВыданУдЛичн,НомерУдЛичн,ДатаУдЛичн,АдрЮР,
		|ДатаРожд,МестоРожд";
	Возврат СтрРазделить(СтрокаРеквизиты, "," + Символы.ПС, Ложь);
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуОрганизации()
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ПроверитьОсновнуюОрганизацию();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ОткрытьФорму("Справочник.Организации.ФормаСписка");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Ключ", Организация);
	ОткрытьФорму("Справочник.Организации.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

// ДЕНЬГИ 
&НаСервере
Процедура ИзменитьСостояниеДекларации(ИндексыСтрок, Сдана)
	
	Если Не ЗначениеЗаполнено(ИндексыСтрок) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Ссылка Из ИндексыСтрок Цикл
		
		Если Не ЗначениеЗаполнено(Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		ОтчетОбъект = Ссылка.ПолучитьОбъект();
		ОтчетОбъект.ДекларацияСдана = Сдана;
		ОтчетОбъект.Записать();
		
	КонецЦикла;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры



// Конец ДЕНЬГИ


#КонецОбласти
